DATA DIVISION.
    WORKING-STORAGE SECTION.
        01  WS-COUNTER PIC 9(2) VALUE 0.
        01  WS-SUM PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    MOVE 0 TO WS-COUNTER.

    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 10
        ADD 1 TO WS-SUM
    END-PERFORM.

    DISPLAY "Sum: " WS-SUM.
    STOP RUN.